Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་གཟུགས་ཞེས་བྱ་བར་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། དེ་ལྟར་ན་སངས་རྒྱས་ཉིད་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བའི་བར་ནི་ཆོས་ཉིད་ཀྱི་མཚན་ཉིད་བསྟན་པའོ།
en: From “Kauśika, they thus should not dwell on the idea of form by way of apprehending something, up to… they thus should not dwell on the idea of buddhahood by way of apprehending something” is teaching the mark of the true nature of dharmas.

source: །ཆོས་ཉིད་ཀྱི་འགྲེས་ལ་ཡང་རྣམ་པ་གསུམ་དུ་བསྟན་ཏེ། ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཉིད་བསྟན་པ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཉིད་བསྟན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཉིད་བསྟན་པའོ།
en: The section on the true nature of dharmas is again a teaching in three parts: teaching the true nature of dharmas on the side of all-knowing, teaching the true nature of dharmas on the side of the knowledge of path aspects, and teaching the true nature of dharmas on the side of the knowledge of all aspects.

source: །གཟུགས་རྟག་གོ་ཞེས་གནས་པར་མི་བྱ། མི་རྟག་གོ་ཞེས་ཀྱང་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་སྦྱིན་གནས་སོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཉིད་བསྟན་པའོ།
en: Teaching the true nature of dharmas on the side of all-knowing is from “they should not dwell on the idea that form is permanent… they should not dwell on the idea that form is impermanent,” up to “they should not dwell on the idea that the tathāgata, worthy one, perfectly complete buddha is worthy of gifts by way of apprehending something.”

source: །ས་དང་པོ་ནས་ས་བཅུ་པའི་བར་ལ་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བ་ནས། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་དགོད་པར་བྱའོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཕྱོགས་དང་མཐུན་པའི་ཆོས་ཉིད་བསྟན་པའོ།
en: Teaching the true nature of dharmas on the side of the knowledge of path aspects is from they “should not stand on the first level… up to the tenth level,” up to they “should not dwell on the idea ‘I will establish infinite, countless beings beyond measure in unsurpassed, perfect, complete awakening’ by way of apprehending something.”

source: །མིག་ལྔ་བསྒྲུབ་པར་བྱ་སྟེ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལུས་ལ་བསྒྲུབ་པར་བྱའོ་ཞེས་བྱ་བར་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཉིད་བསྟན་པའོ།
en: Teaching the true nature of dharmas on the side of the knowledge of all aspects starts from “ ‘I will make the five eyes perfect,’ ” up to “they should not dwell on the idea ‘I will make the eighty minor signs perfect on the body.’ ”

source: །གང་ཟག་བསྟན་པའི་འགྲེས་ལ་ཡང་ཐམས་ཅད་ཤེས་པ་ཉིད་ཀྱི་ཕྱོགས་ལ་སོགས་པའི་དབང་གིས་རྣམ་པ་གསུམ་དུ་སྦྱར་བར་བྱ་སྟེ།
en: Again, construe the section teaching persons in three parts, based on the all-knowledge side and so on.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ལ་གནས་ཏེ། ཏིང་ངེ་འཛིན་གང་ལ་སྙོམས་པར་ཞུགས་པས་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སའི་ཕྱོགས་ཀྱི་ཆོས་སོ།
en: The dharmas where it says, “I will, standing on the four legs of miraculous power, become completely absorbed in meditative stabilization,” and so on, are on the side of the level of the knowledge of all aspects.

source: །འོ་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པར་བྱ་སྙམ་ཞེས་བྱ་བ་གནས་བརྟན་རབ་འབྱོར་ཅི་ལས་སེམས་པར་གྱུར་ཅེ་ན།
en: What is the elder Śāriputra thinking where it says, “Then it occurred to [him] to think, ‘Well then, however could bodhisattva great beings stand in the perfection of wisdom?’ ”

source: ཆོས་ཐམས་ཅད་ལ་གནས་པར་མི་བྱའོ་ཞེས་བཤད་ཅིང་སྟོང་པ་ཉིད་ལ་ནི་གནས་པར་མི་ནུས་ལ་གནས་པར་མི་བྱའོ་ཞེས་ཀྱང་བཤད་ན་དེ་ཇི་ལྟར་རིགས་པར་འགྱུར་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ།
en: He was thinking that it has said “they should not stand in all dharmas,” and that it has said it is not possible to stand in emptiness, hence “they should not stand” in it either. How could that be right?

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་མི་གནས་པར་སྒྲུབ་པ་ཉིད།
en: Then the elder Subhūti establishes that they do not stand.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཡིན་པར་བསྟན་པ། དེ་བཞིན་གཤེགས་པའི་ཐུགས་ནི་ཅི་ལའང་གནས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་སྟེ་མི་གནས་པའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞུགས་པར་བསྟན་ཏོ།
en: The teaching that that is standing in the perfection of wisdom is “the tathāgatas have totally nonabiding minds.” It is teaching that they stand in nonabiding nirvāṇa.

source: །དེ་ལྟར་མི་གནས་པ་ལ་གནས་པའི་བསྒྲུབ་པ་བཤད་པས་གདུལ་བ་ལས་བརྩམས་ཏེ་བཤད་པ་ལ་བརྗོད་དུ་མེད་པར་བཤད་པས་འདུལ་བ་གང་ཡིན་པ་དེ་དག་ཐེ་ཚོམ་ཟོས་པར་གྱུར་ཏེ།
en: It has explained the achievement, standing without standing like that, and in the explanation based on those to be trained has said it is inexpressible. So those to be trained come to harbor doubts.

source: དེ་བས་ན་དེ་དག་ལ་བརྩམས་ནས་བཤད་པ་གཞན་སྐབས་ཕྱ་སྟེ།
en: Therefore, taking them as its point of departure, it sets the scene for another explanation with, “O gods, is what is said incomprehensible?”

source: ལྷའི་བུ་དག་གང་སྨྲས་པ་ཤེས་པར་མི་རུང་ངམ་ཞེས་བྱ་བ་ལ་སོགས་པས་གང་བརྗོད་པ་དེ་དག་ཅིའི་ཕྱིར་མི་ཤེས་སམ་ཞེས་ལྷའི་བུ་རྣམས་ལ་དྲིས་པ་དང་། དེའི་ཕྱིར་དེ་དག་གིས།
en: and so on, asking the gods the question, “Why have you not understood what has been said?”

source: འཕགས་པ་རབ་འབྱོར་ཤེས་པར་མི་རུང་ངོ་ཞེས་སྨྲས་ཏེ།
en: They then reply, “Incomprehensible, Ārya Subhūti!”

source: དེ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྗོད་དུ་མེད་པ་ཡིན་པའི་ཕྱིར་གནས་བརྟན་གྱིས་ཡི་གེ་གཅིག་ཀྱང་མ་བརྗོད་དེ་ཞེས་བྱ་བ་གསུངས་ཏེ། འདི་ལྟར་དེ་ན་བཤད་པར་སྣང་བ་དང་། མཉན་པར་སྣང་བ་དེ་ནི་ཀུན་བརྟགས་པ་ཡིན་ནོ་ཞེས་སྤྲུལ་པ་དང་། རྨི་ལམ་དང་། བྲག་ཅ་དང་། སྒྱུ་མ་ལྟ་བུར་བསྟན་པས་ལྷའི་བུ་དེ་རྣམས་དགའ་བར་བྱས་སོ།
en: Then, because the perfection of wisdom is inexpressible, the elder says “not even one syllable is said here,” teaching that since this is the case, the apparent talking and apparent hearing are falsely imagined phenomena, like a “magical creation… a dream… an echo… and a magical illusion,” thus making the gods happy. “

source: །སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པའོ།
en: A magically created buddha” is a magically created body of a tathāgata. “

source: །ལྷའི་བུ་དག་གཟུགས་ནི་ཟབ་པ་མ་ཡིན་ཕྲ་བ་མ་ཡིན་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ཡང་དག་པ་མ་ཡིན་པའི་ཕྱིར་ཟབ་པ་མ་ཡིན་ཕྲ་བ་མ་ཡིན་ནོ།
en: O gods, form is not deep and is not subtle.” Because a falsely imagined form is a not real form, it “is not deep and is not subtle.”

source: ཡང་ལྷའི་བུ་དག་འདི་ལྟར་གཟུགས་ཀྱི་རང་བཞིན་ནི་ཟབ་པ་མ་ཡིན་ཕྲ་བ་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པས་ཆོས་ཉིད་ཀྱི་གཟུགས་ནི་ངོ་བོ་ཉིད་ཀྱིས་མི་གཡོ་བའི་ཕྱིར་ཟབ་པ་མ་ཡིན། ཕྲ་བ་མ་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: Again, “it is because the intrinsic nature of form is not deep and is not subtle,” and so on, teaches that because the true dharmic nature of form does not, in its intrinsic nature, move, it “is not deep and is not subtle.”

source: །དེ་བས་ན་འདིར་ནི་འགྲེས་རྣམ་པ་གཉིས་ཏེ། ཆོས་ཀྱི་འགྲེས་དང་རང་བཞིན་གྱི་འགྲེས་སོ།
en: So here the section of the text is in two parts: the dharma section and the intrinsic nature section. “

source: །འོ་ན་ཆོས་བསྟན་པ་འདི་ལ་གཟུགས་སུ་བརྟགས་པ་ཡང་མེད་དམ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་གལ་ཏེ་ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་ན་དེ་ལྟ་ན་ནི་གཟུགས་ལ་སོགས་པ་ལ་མ་བརྟགས་སམ། མ་བཤད་དམ་ཞེས་ལྷའི་བུ་རྣམས་ཀྱིས་དྲིས་པ་དང་།
en: Well then, in this Dharma teaching has nothing been designated form?” and so on. The gods ask: if all dharmas are inexpressible, well then, is nothing “designated” or explained as “form”?

source: དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ་དེ་དེ་བཞིན་ཏེ་ཞེས་བརྟགས་པ་མེད་པ་དང་། བཤད་པ་མེད་པ་ཉིད་དུ་བསྟན་ཏོ།
en: Then the elder Subhūti says, “Exactly so, gods, exactly so,” teaching that they are indeed not designated and not explained.

source: །བཟོད་པ་འདི་ལ་མི་བརྟེན་དུ་མི་རུང་ཞེས་བྱ་བ་ནི་བརྗོད་དུ་མེད་པའི་བཤད་པ་འདི་ལའོ།
en: They “cannot, without having resorted to this forbearance,” which is to say, to this explanation of the inexpressible. “[

source: །གནས་བརྟན་རབ་འབྱོར་ལ་ཆོས་ཉན་པ་རྣམ་པ་ཇི་ལྟ་བུ་དག་ཏུ་འདོད་པར་བྱ་སྙམ་མོ་ཞེས་བྱ་བ་ནི།
en: Then it occurred to those gods to] think, ‘What would the elder Subhūti accept those listening to the Dharma to be like?’ ”

source: གལ་ཏེ་དོན་དམ་པར་བརྗོད་དུ་མེད་པ་ཡིན་ན། འཆད་པ་པོ་དང་ཉན་པ་པོ་མེད་པས། ཆོས་ཉན་པ་ཡང་མེད་པར་འགྱུར་རོ་ཞེས་སྟོན་ཏོ།
en: This is teaching that if they are ultimately inexpressible there will be no speaker and no hearer, so there will be no listening to the Dharma. “

source: །དེ་ན་གནས་བརྟན་རབ་འབྱོར་གྱིས་ལྷའི་བུ་དག་བདག་ལ་ཆོས་ཉན་པ་ནི་སྒྱུ་མ་ལྟ་བུར་འདོད་པར་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པས་དོན་དམ་པར་འཆད་པ་པོ་དང་། ཉན་པ་པོ་མེད་པ་ཉིད་དུ་སྟོན་ཏོ། །བཙུན་པ་རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལྟར་ཟབ་པ། འདི་ལྟར་མཐོང་བར་དཀའ་བ་ཞེས་བྱ་བ་ལ། གཏིང་དཔག་དཀའ་བས་ན་ཟབ་པའོ། །རྣམ་པར་ཤེས་པའི་ཚོགས་ལྔའི་ཡུལ་མ་ཡིན་པའི་ཕྱིར་མཐོང་བར་དཀའ་བའོ། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཡུལ་མ་ཡིན་པའི་ཕྱིར་རྟོགས་པར་དཀའ་བའོ། །ཉོན་མོངས་པ་དང་ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བའི་ཕྱིར་ཞི་བའོ། །སྡུག་བསྔལ་ཐམས་ཅད་ཀྱི་བར་དག་ཉེ་བར་ཞི་བའི་ཕྱིར་གྱ་ནོམ་པའོ། །རྣམ་པར་རྟོག་པའི་སྤྲོས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བའི་ཕྱིར་ཕྲ་བའོ། །སོ་སོ་རང་གིས་རིག་པ་ཡིན་པའི་ཕྱིར་གཞན་མ་ཡིན་པའོ། །བསམ་པའི་ལམ་ལས་འདས་པའི་ཕྱིར། རྟོག་གེའི་སྤྱོད་ཡུལ་མ་ཡིན་པའོ།
en: Gods, I would accept those listening to the Dharma to be like illusory beings,” and so on, teaches that ultimately a speaker and a hearer are nonexistent. “

source: །ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་ལ་མཁས་པའི་རྒྱུ་ཡིན་པའི་ཕྱིར་མཁས་པའོ། །འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྟོགས་པའི་གནས་ཀྱི་མཆོག་ཡིན་པས་ཤིན་ཏུ་འཕགས་པའོ། །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་མ་ཡིན་པ་དང་། ཕྱིར་མི་ལྡོག་པ་རྣམས་ཉིད་ཀྱིས་རིག་པར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་མཁས་པ་དང་མཛངས་པས་རིག་པར་བྱའོ།
en: Venerable monk Subhūti, who will be the recipients of this perfection of wisdom so deep, so hard to behold,” and so on—it is “deep” because it is hard to fathom; “hard to behold” because it is not an object of the five collections of consciousnesses; “hard to understand” because it is not an object of thinking-mind consciousness; “peaceful” because all the afflictions and secondary afflictions have calmed down; “sublime” because up to “all suffering” has calmed down; “subtle” because all conceptual thought constructions have calmed down; “private” because it is self-reflexive analytic knowledge; “not an object of speculative thought” because it transcends the path of thinking; “brilliant” because it is the cause for brilliance in the realization of all dharmas as they really are; “absolutely noble” because it is the supreme place for the realization of extraordinary dharmas; and “an object to be known by the learned and wise” because it is not an object within the range of śrāvakas and pratyekabuddhas, and it is not an object to be known by the irreversible bodhisattvas.

source: །ལེན་པར་བྱེད་པར་འགྱུར་ཞེས་བྱ་བ་ནི་འཛིན་པའོ།
en: They “will be the recipients”— they will be those who take it up.

source: །བདེན་པ་མཐོང་བའི་གང་ཟག་གམ། དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་འམ་ཞེས་བྱ་བ་ལ་སོགས་པས་སྔར་ཀུན་རྫོབ་ཏུ་ཚོལ་བར་བྱེད་པ་བསྟན་ཏོ།
en: With “persons who have seen the truths, or worthy ones with outflows dried up,” and so on, it first teaches those who are seeking conventionally.

source: །དེ་ལ་དོན་དམ་པར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལ་བདེན་པ་མཐོང་བ་ཞེས་གསུངས་སོ། །བྱང་ཆུབ་ཏུ་འགྱུར་བ་ནི་དགྲ་བཅོམ་པ་ཞེས་བྱ་བའོ།
en: There, in the ultimate sense, bodhisattvas are spoken of as those “who have seen the truths”; when they are awakened, they are called “worthy ones.”

source: །དེ་ལྟར་ཀུན་རྫོབ་ཏུ་བསྟན་ནས་ཡང་དོན་དམ་པར་བསྟན་པ་དེ་དག་ནི་གཟུགས་སྟོང་ངོ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་ཞེས་བྱ་བ་ནས། ལེན་པར་བྱེད་པ་སུ་ཡང་མེད་དོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: Having taught them conventionally, those being taught ultimately are from “they will not construct the idea that form is empty,” up to “so too no being at all will be the recipient of it.”

source: འདིས་ནི་གང་དག་དེ་ལྟར་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་སུམ་དུ་བྱས་པར་གྱུར་པ་དེ་དག་ཉིད་ཚོལ་བར་བྱེད་པ་ཡིན་ཏེ།
en: This teaches that just those who have directly realized the nonconceptual perfection of wisdom are those who are seeking.

source: དེ་དག་ཀྱང་དོན་དམ་པར་བཙལ་བར་བྱ་བ་མེད་པའི་ཕྱིར་ཚོལ་བར་བྱེད་པ་མ་ཡིན་ནོ་ཞེས་སྟོན་ཏོ།
en: Ultimately there is nothing they will have sought for, so they are not those who are seeking.

source: །དེ་སྐད་སྨྲས་པ་དང་། གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུས་འཆད་པ་པོ་དང་། ཉན་པ་པོ་མེད་པར་དམ་བཅས་པ་ལུང་དང་འགལ་བར་བསྟན་པས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ཐེག་པ་གསུམ་རྒྱ་ཆེར་མ་བསྟན་ཏམ་ཞེས་བྱ་བ་ལ་སོགས་པ་སྟེ། ཐེག་པ་གསུམ་བཤད་པ་དང་།
en: Then venerable Śāriputra says the assertion that a talker and a hearer are nonexistent contradicts scripture: “Venerable Subhūti, is it not the case that in this perfection of wisdom the three vehicles… are taught in detail?”

source: ས་བཅུ་ཡོངས་སུ་བཟུང་བ་དང་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་། དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་སྐྱེ་བ་དང་། མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བས་གནས་པ་དང་།
en: and so on.

source: ཆོས་ཉན་པ་དང་། མི་བརྗེད་པ་དང་། སེམས་འཁྲུགས་པ་མེད་པ་དང་། སྤོབས་པའི་ཡོན་ཏན་བདུན་ལ་སོགས་པ་ཆོས་འདི་རྣམས་བསྟན་ཏེ། བདག་ཅག་གིས་ཀྱང་ཐོས་སོ་ཞེས་སྟོན་ཏོ།
en: The explanation of the three vehicles; and the teaching about “the ten levels… the assistance,” and “the bodhisattva path” of the perfections and so on; and about these dharmas: birth in the family of a tathāgata, sporting with “the clairvoyances,” hearing, not forgetting, being without distraction, and the sevenfold “confident readiness,” and so on—he is saying ‘We ourselves have heard about these.’

source: །དེའི་འོག་ཏུ་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཆོས་འདི་རྣམས་མི་དམིགས་པའི་ཚུལ་གྱིས་བཤད་ཀྱི། དོན་དམ་པར་ནི་ཡོད་པ་མ་ཡིན་ཏེ། དེ་བས་ན་བཤད་པ་ཡང་འཁྲུལ་པ་ཙམ་མོ་ཞེས་བསྟན་པའི་ཕྱིར། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ་དེ་དེ་བཞིན་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: After that, the elder Subhūti, to teach that the explanation of these dharmas is by way of not apprehending anything, to teach they do not exist ultimately and hence that even talking is mere illusion, says, “Exactly so, Venerable Śāriputra, exactly so,” and so on.

source: །དེ་དག་སྟོང་པ་ཡིན་པའི་གཏན་ཚིགས་ནང་སྟོང་པ་ཉིད་དང་ཞེས་བྱ་བ་ནས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: About the reason they are empty, it says “because of inner emptiness,” up to “because of the emptiness that is the nonexistence of an intrinsic nature,” and so on.

source: །ལྷའི་བུ་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བ་འབྱུང་བའི་མཚན་མ་བསྟན་པའི་ཕྱིར་མེ་ཏོག་གི་མཆོད་པ་བསྟན་ཏེ།
en: It says the gods worship with flowers to teach the gods the sign of the emergence of the light of transcendental knowledge.

source: མེ་ཏོག་འདི་དག་སྤྲུལ་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་བསམས་པ་འོག་ནས་བསྟན་པའི་སྐབས་དབྱེ་བའི་ཕྱིར་རོ།
en: This is in order to set the scene for the thought that comes next, “these flowers have been magically created,” and so on. “

source: །ཀཽ་ཤི་ཀ་མེ་ཏོག་འདི་དག་མ་བྱུང་བ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་མ་སྐྱེས་པ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཡིན་གྱི། མེ་ཏོག་གི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ་ཞེས་སྟོན་ཏོ།
en: Kauśika… these flowers have not come about” is saying that they are not marked as thoroughly established, that they have emptiness as their intrinsic nature, and are not flowers as their intrinsic nature. “

source: །ཀཽ་ཤི་ཀ་གཟུགས་ཀྱང་མ་བྱུང་བ་སྟེ།
en: Kauśika, form also has not come about, and what has not come about is not form.”

source: གང་མ་བྱུང་བ་དེ་ནི་གཟུགས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པའི་གཟུགས་ལ་འདུས་བྱས་ཀྱི་སྐྱེ་བ་མེད་པའི་ཕྱིར་གཟུགས་མ་བྱུང་བའོ་ཞེས་བསྟན་པའོ། །དེ་ལྟར་འདུས་མ་བྱས་པ།
en: It says “form also has not come about” because an ultimate form does not have the production of a compounded form.

source: མ་སྐྱེས་པ་ལ་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་མཚན་ཉིད་མེད་པའི་ཕྱིར་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ནོ་ཞེས་བསྟན་པའོ།
en: Thus, it says “what has not come about is not form” because an uncompounded phenomenon that has not come about does not have the mark of a falsely imagined form. “

source: །བཏགས་པ་དང་ཡང་མི་འགལ་ལ། ཆོས་ཉིད་ཀྱང་སྟོན་ཏེ་ཞེས་བྱ་བ་ནི་ཀུན་རྫོབ་དང་དོན་དམ་པར་མི་འགལ་བར་བསྟན་ཏོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།། །།
en: Does not contradict designation and gives instruction in the true nature of dharmas” means he gives instruction without contradicting the ultimate or the conventional.

source: བམ་པོ་བཅོ་བརྒྱད་པ།
en: How should bodhisattva great beings train in the perfection of wisdom? “

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དེ་ལྟར་ཆོས་ཐམས་ཅད་བརྟགས་པ་ཙམ་དུ་རིག་པར་བྱས་ཏེ།
en: Kauśika, bodhisattva great beings, having thus understood how all dharmas are mere designations, should train in the perfection of wisdom.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་གང་སྔར་རྣམ་པ་གསུམ་དུ་ཞུས་པ་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི་ཞེས་ཐ་མར་ཞུས་པ་དེ་སྟོན་ཏོ།
en: This indicates the last of the three earlier questions, “How should a bodhisattva great being train in the perfection of wisdom?” “

source: །གཟུགས་ལ་མི་སློབ་ཅེས་བྱ་བ་ལ་སོགས་པ་ནི་མི་སློབ་པ་ཉིད་སློབ་པ་སྟེ་དཔེར་ན་གནས་པ་མེད་པ་ཉིད་གནས་པའོ་ཞེས་བྱ་བ་ལྟ་བུར་སྟོན་ཏོ།
en: Do not train in form,” and so on—this is saying they train without training, just as, to illustrate, they stand without standing.

source: །གཟུགས་ལ་སོགས་པ་དངོས་པོ་མེད་པར་མཐོང་བས་གཟུགས་ལ་སོགས་པ་ལ་མི་སློབ་ཅེས་བྱའོ་ཞེས་བསྟན་པའི་ཕྱིར། འདི་ལྟར་གང་ལ་བསླབ་པར་བྱ་བའི་གཟུགས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: In order to teach that “they do not train in form and so on because they see that form and so on are nonexistent things,” it says “because they do not see the form in which they train,” and so on. “

source: །གཟུགས་ལ་སོགས་པ་ཅིའི་ཕྱིར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞེས་བརྒྱ་བྱིན་གྱིས་དྲིས་པ་དང་།
en: Śatakratu… inquired… why do bodhisattva great beings not see form,” and so on, and to teach that “they do not see form because it is empty,” it says “form is empty of form.”

source: སྟོང་པ་ཡིན་པས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བསྟན་པའི་ཕྱིར། གཟུགས་གཟུགས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་གསུངས་སོ། །མི་སློབ་པའི་གཏན་ཚིགས་སུ། ཀཽ་ཤི་ཀ་གཟུགས་སྟོང་པ་ཉིད་ནི་གཟུགས་སྟོང་པ་ཉིད་ལ་མི་སློབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: It says, “Kauśika, it is because the emptiness of form does not train in the emptiness of form,” and so on, as the reason they do not train.

source: སློབ་པ་གང་ཡིན་པ་དང་གང་ལ་སློབ་པ་དེ་གཉིས་ཀ་ཡང་མེད་པའི་ཕྱིར་སློབ་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means both a training and something that is trained in are nonexistent, so they do not train.

source: །དེའི་འོག་ཏུ་ཀཽ་ཤི་ཀ་གང་གཟུགས་སྟོང་པ་ཉིད་ལ་མི་སློབ་ཅེས་བྱ་བ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མི་སློབ་པ་དེ་ནི་གཉིས་སུ་བྱར་མེད་པར་གཟུགས་སྟོང་པ་ཉིད་ལ་སློབ་པོ་ཞེས་བྱ་བ་ནས་གཉིས་སུ་བྱར་མེད་པར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟོང་པ་ཉིད་ལ་སློབ་པོ་ཞེས་བྱ་བ་ནི་གང་མི་སློབ་པ་དེ་ཉིད་སློབ་པ་ཡིན་པར་སྟོན་ཏོ།
en: Then, “Kauśika, those who do not train in the emptiness of form… up to those who do not train in the emptiness of the knowledge of all aspects, train in the emptiness of form without making a division into two, up to train in the emptiness of the knowledge of all aspects without making a division into two,” says that just those who do not train are the ones who train. “

source: །གཉིས་སུ་བྱར་མེད་པར་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་དུ་གཅིག་པའི་ཕྱིར་གཅིག་གི་སྟོང་པ་ཉིད་ལ་བསླབས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྟོང་པ་ཉིད་ལ་བསླབ་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་བས་ན།
en: Without making a division into two” means they are the same as emptiness, so, when they have trained in the emptiness of a single dharma, they have trained in the emptiness of all.

source: གཅིག་གི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཀུན་གྱི་སྟོང་པ་ཉིད་ཅེས་བཤད་དོ།
en: Hence it is explaining that the emptiness of a single dharma is the emptiness of all.

source: །དེའི་འོག་ཏུ་ཀཽ་ཤི་ཀ་གང་གཉིས་སུ་བྱར་མེད་པ་གཟུགས་སྟོང་པ་ཉིད་ལ་སློབ་པ་ཞེས་བྱ་བ་ནས་གཉིས་སུ་བྱར་མེད་པར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སློབ་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་གྲངས་མེད།
en: Then it says, “Those who train in the emptiness of form without making a division into two, up to train in the knowledge of all aspects without making a division into two… train in countless, infinite buddhadharmas.”

source: དཔག་ཏུ་མེད་པ་རྣམས་ལ་བསླབ་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་གང་དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་སྟོང་པ་ཉིད་ལ་བསླབ་པ་དེ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དག་ལ་བསླབ་པ་ཡིན་ནོ་ཞེས་སྟོན་ཏོ།
en: This is teaching that those who thus train in the emptiness of all dharmas train in the six perfections and so on, up to train in all the buddhadharmas.

source: །དེའི་འོག་ཏུ་དེ་ནི་གཟུགས་འཕེལ་བར་བྱ་བ་དང་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པོ་ཞེས་བྱ་བ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དག་ལ་སློབ་པ་དེ་གཟུགས་ལ་སོགས་པ་ལ་འཕེལ་བར་བྱ་བའམ། འགྲིབ་པར་བྱ་བ་མེད་པར་སྟོན་ཏེ།
en: Then, “do not train in order to increase or decrease form,” teaches that training in the perfections and so on, up to the buddhadharmas, is not to increase or decrease form and so on.

source: དཀར་པོའི་ཕྱོགས་འཕེལ་བར་བྱ་བའམ། ནག་པོའི་ཕྱོགས་འགྲིབ་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that training is not to increase the bright side or decrease the dark side.

source: །དེའི་འོག་ཏུ་དེ་ནི་གཟུགས་ཡོངས་སུ་གཟུང་བ་དང་མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་པོ་ཞེས་བྱ་བ་ནི་གང་ལ་དེ་ལྟར་འཕེལ་བར་བྱ་བ་དང་། འགྲིབ་པར་བྱ་བའི་ཆོས་རྣམས་མེད་པ་དེ་ལ་ཁྱད་པར་དུ་འཕགས་པའི་ཆོས་རྣམས་ཡོངས་སུ་བཟུང་ཞིང་ཆོས་ངན་པ་རྣམས་ཆུད་གསན་པར་བྱ་བ་མེད་པར་སྟོན་ཏོ། །དེ་སྐད་སྨྲས་པ་དང་།
en: Then, “[do] not train in order to get hold of or get rid of form” is teaching that where there are thus no dharmas to be increased or decreased, there are no special dharmas to be gotten hold of and no bad dharmas to be reduced.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་དེ་ཡོངས་སུ་འཛིན་པ་དང་མེད་པར་བྱ་བའི་ཕྱིར་མི་སློབ་ཅེས་གསུངས་པ་ནི་གནས་བརྟན་ཤཱ་རིའི་བུས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ངན་པ་རྣམས་ཡོངས་སུ་སྤོང་ཞིང་ཁྱད་པར་དུ་འཕགས་པའི་ཆོས་རྣམས་ཐོབ་པར་བྱེད་ན་དེ་ལ་ཅིའི་ཕྱིར་ཡོངས་སུ་འཛིན་པ་དང་།
en: It says that, and then with “Venerable Subhūti, why do bodhisattva great beings not train in order to get hold of or get rid of form?” the elder Śāriputra asks him why, given that bodhisattvas eliminate bad dharmas and obtain special dharmas, there is nothing for them to get hold of or get rid of.

source: མེད་པར་བྱ་བ་མེད་ཅེས་འདྲི་བའོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། གནས་བརྟན་རབ་འབྱོར་གྱིས་གཟུགས་ལ་གཟུགས་ཡོངས་སུ་མི་འཛིན་ཏོ་ཞེས་བྱ་བ་གསུངས་ཏེ། གཟུང་བ་དང་འཛིན་པ་རྣམས་མེད་པར་སྟོན་ཏོ།
en: After he asks that, the elder Subhūti says “form does not get hold of form,” teaching that there are no grasped and grasper.

source: །དེའི་གཏན་ཚིགས་སུ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བ་གསུངས་སོ།
en: It gives as the reason for that, “based on… emptiness.” “

source: །གཟུགས་ཀྱི་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་གློ་བུར་ལ་ནི་སྐྱེ་བ་མེད་དོ།
en: Does not see the production… of form,” and so on—something plucked out of thin air has no “production.”

source: །གནས་པ་ནི་མི་འགྱུར་བའི་ངོ་བོ་ཉིད་ཡིན་པས་འགག་པ་མེད་དོ།
en: Something lasting in its nature does not change so there is no “stopping.”

source: །དེ་བཞིན་ཉིད་ལ་སྐྱེ་བ་མེད་པའི་སྔོན་མ་བྱུང་བ་བླང་བ་མེད་དོ།
en: In suchness there is no production so there is no “acceptance” of something not there before.

source: །འགག་པ་མེད་པས་བཟུང་བ་ལས་དོར་བ་མེད་དོ།
en: There is no stopping so there is no “rejection” of something gotten hold of.

source: །གཟུང་བར་བྱ་བ་མེད་པས་སྔོན་མ་བྱུང་བའི་རྣམ་པར་བྱང་བ་མེད་དོ།
en: There is nothing to get hold of so there is no “purification” of something not there before.

source: །དོར་བར་བྱ་བ་མེད་པས་སྤང་བར་བྱ་བའི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ།
en: There is nothing to reject so there is no “defilement” to eliminate.

source: །རྣམ་པར་བྱང་བ་མེད་པས་འཕེལ་བ་མེད་དོ། །ཀུན་ནས་ཉོན་མོངས་པ་མེད་པས་འགྲིབ་པ་མེད་དོ།
en: Since there is no purification there is no “increase,” and since there is no defilement there is no “decrease.” “

source: །བཙུན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ནས་བཙལ་བར་བྱ་ཞེས་བྱ་བ་ནི་འདིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་ལས་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་།
en: Venerable monk… where should you look for the perfection of wisdom?”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྟན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲིས་སོ།
en: He asks about the perfection of wisdom to teach, in regard to the perfection of wisdom itself, the knowledge of path aspects and the knowledge of all aspects. “
